{
    "edition": "Data Founders",
    "articles": [
        {
            "author": "Kalin Naidoo",
            "title": "Subtle.How",
            "linkedin":"https://www.linkedin.com/in/kalinnaidoo01132/",
            "name": "Subtle Inc",
            "twitter": "guy01132,Subtle_How",
            "link": "https://www.subtle.how",
            "summary": "My name is Kalin Naidoo and I am a data founder. I am database developer by trade and have been working as a database developer since 2014.I creating a trusted workplace application for people of color leveraging available disclosed data.Subtle is a mobile application and social network that helps consumers, employees, and employment seekers of diverse backgrounds measure corporate authenticity towards diversity, equity, and inclusion by using the latest news, disclosed workforce data, and employee reviews.A centralized repository where users can get all related and relevant data in one place.Our goal is to remove the fluff, normalize the data and allow consumers to compare companies to each other and get a rough estimate of the companies stack up against each other and how they have done against the leaders in industry and sector.We offer a high level summary of authenticity along with access to underlying datasets as to why. EEO1 insights allow customers to see if people of color are leaving at higher rates as well as if demographic is being promoted to managerial roles at higher or lower rates. The EEO1 report is a demographic report all companies with 100 employees have to report to the Equal Employment Opportunity Commission or EEOC, that breaks the companies demographics down to 10 job categories and 7 racial demographics. It is something companies fought to keep from disclosing in the past but have recently begun to disclose on their own after the murder of George Floyd.Subtle is a community where consumers can lean on each other for advice and share lived experiences.Subtle is a resource + tool to help people of diverse backgrounds navigate and succeed in corporate America.But more then that Subtle is a social movement.There is a change in mindset that’s taking place, a greater recognition that we can do better.It’s very important for us to take the momentum that has been created as a society, as a country, and say let’s use this to finally have an impact.- Obama after the George Floyd murder. Our big audacious goal is to make corporate disclosures of EE01 report standard practice for all companies.With my professional domain expertise in database development I think it will be something of value with sourcing the disclosed workforce data and standardizing for Subtle customers to be able to compare companies against each other. I also have personal domain experience. A couple years ago I took a job at a company where I experienced racial discrimination. I realized then that HR works for the company, not the employees. I know people need what I am making because I am one of those people. A study done by a UK company called the vault highlighted the problem as Trust gap. The study found 37 percent of US office workers believed their organization would brush aside at least one form of workplace misconduct if it was likely to impact profit or reputation. What was more troubling was 30 percent of US HR and compliance DMs surveyed believed their organization would look to ignore at least one form of workplace misconduct if it was likely to impact profits or reputation.One of the reasons I know people need what I am making is because of the moment we are living in. With covid and the Great Resignation people are finally sick of putting up with being treated unfairly. They are tired of being discriminated against at work and have decided there are better opportunities out there then the ones they are living with now. An MIT study found that toxic culture in the workplace was driving the great resignation and that it was not just about not pay increase.Another reason why the moment is now is because before the murder of George Floyd it was a taboo topic to discuss Race and discrimination. The frustrating part is it's still not easy navigate on the current solutions like Glassdoor, Teamblind, and Fishbowl. These websites cover racial discrimination but more so as an after thought.Doing research on corporations and the company culture is difficult and time consuming.I know before I take a job I do my research on the company. I usually start on the companies website and look for their diversity and inclusion page to see if they care about diversity. Then I check the reviews to see what people are saying about the company but usually there is not too much race related reviews.I know Glassdoor failed me when I did my research on the company I mentioned above.I recently read a story from the Washington Post that helped me understand I was not alone and this research was common place for people of color. It described the lengthy process people of color started to take to vet a company before accepting a position.With Subtle we are  creating a one stop shop that captures each part of the research phase a person with a diverse background might take. First the corporate news they would find when googling a company. Second, the diversity and workforce metrics a employment seeker would find when going to a company's website.This part of the process can be tricky because without a baseline it's hard to really tell how the company being researched is doing against others in the space. Finally the employment seeker would check the reviews on Glassdoor but if the reviews don’t explicitly say racism or discrimination they can be hard to find.",
            "tags": "DEI, The Great Resignation, Future of Work"
            "urls": [
                "https://www.washingtonpost.com/business/2021/02/18/millennial-genz-workplace-diversity-equity-inclusion/",
                "https://f.hubspotusercontent20.net/hubfs/4979575/Whitepapers/The%20Trust%20Gap%20Report.pdf",
                "https://sloanreview.mit.edu/article/toxic-culture-is-driving-the-great-resignation/"
                
            ]
        }
    ]
}
